cmsis-svd/cmsis-svd/data/Spansion/MB9AF13xN_svd.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description>Software-based Simultaneous Startup Register</description>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description>Software-based Simultaneous Startup Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR15" -->
            <field>
              <name>SSSR15</name>
              <description>Bit15 of BTSSSR</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR14" -->
            <field>
              <name>SSSR14</name>
              <description>Bit14 of BTSSSR</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR13" -->
            <field>
              <name>SSSR13</name>
              <description>Bit13 of BTSSSR</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR12" -->
            <field>
              <name>SSSR12</name>
              <description>Bit12 of BTSSSR</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR11" -->
            <field>
              <name>SSSR11</name>
              <description>Bit11 of BTSSSR</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR10" -->
            <field>
              <name>SSSR10</name>
              <description>Bit10 of BTSSSR</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR9" -->
            <field>
              <name>SSSR9</name>
              <description>Bit9 of BTSSSR</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR8" -->
            <field>
              <name>SSSR8</name>
              <description>Bit8 of BTSSSR</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR7" -->
            <field>
              <name>SSSR7</name>
              <description>Bit7 of BTSSSR</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR6" -->
            <field>
              <name>SSSR6</name>
              <description>Bit6 of BTSSSR</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR5" -->
            <field>
              <name>SSSR5</name>
              <description>Bit5 of BTSSSR</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR4" -->
            <field>
              <name>SSSR4</name>
              <description>Bit4 of BTSSSR</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description>Bit3 of BTSSSR</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description>Bit2 of BTSSSR</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description>Bit1 of BTSSSR</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description>Bit0 of BTSSSR</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BT0" -->
    <peripheral>
      <name>BT0</name>
      <description>Base Timer 0</description>
      <groupName>BT0</groupName>
      <baseAddress>0x40025000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "BTIM" -->
      <interrupt>
        <name>BTIM</name>
        <value>28</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "PWM_TMCR" -->
        <register>
          <name>PWM_TMCR</name>
          <description>Timer Control Register</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7F7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS2_0" -->
            <field>
              <name>CKS2_0</name>
              <description>Count clock selection bit</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTGEN" -->
            <field>
              <name>RTGEN</name>
              <description>Restart enable bit </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PMSK" -->
            <field>
              <name>PMSK</name>
              <description>Pulse output mask bit</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description>Trigger input edge selection bits </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description>Timer function selection bits </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSEL" -->
            <field>
              <name>OSEL</name>
              <description>Output polarity specification bit </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description>Mode selection bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description>Count operation enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG" -->
            <field>
              <name>STRG</name>
              <description>Software trigger bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWM_TMCR2" -->
        <register>
          <name>PWM_TMCR2</name>
          <description>Timer Control Register 2</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description>Count clock selection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWM_STC" -->
        <register>
          <name>PWM_STC</name>
          <description> Status Control Register</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x77</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGIE" -->
            <field>
              <name>TGIE</name>
              <description>Trigger interrupt request enable bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIE" -->
            <field>
              <name>DTIE</name>
              <description>Duty match interrupt request enable bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIE" -->
            <field>
              <name>UDIE</name>
              <description>Underflow interrupt request enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGIR" -->
            <field>
              <name>TGIR</name>
              <description>Trigger interrupt request bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIR" -->
            <field>
              <name>DTIR</name>
              <description>Duty match interrupt request bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIR" -->
            <field>
              <name>UDIR</name>
              <description>Underflow interrupt request bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWM_PCSR" -->
        <register>
          <name>PWM_PCSR</name>
          <description>PWM Cycle Set Register</description>
          <alternateGroup>PWM</alternateGroup>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
