cmsis-svd/cmsis-svd/data/Spansion/MB9AF13xN_svd.xml
        <!-- REGISTER "COMP2" -->
        <register>
          <name>COMP2</name>
          <description>PPG Compare Register 2</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "COMP4" -->
        <register derivedFrom="COMP0">
          <name>COMP4</name>
          <description>PPG Compare Register 4</description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "COMP6" -->
        <register derivedFrom="COMP2">
          <name>COMP6</name>
          <description>PPG Compare Register 6</description>
          <addressOffset>0x14</addressOffset>
        </register>
        <!-- REGISTER "TRG" -->
        <register>
          <name>TRG</name>
          <description>PPG Start Register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEN07" -->
            <field>
              <name>PEN07</name>
              <description>PPG7 Start Trigger bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN06" -->
            <field>
              <name>PEN06</name>
              <description>PPG6 Start Trigger bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN05" -->
            <field>
              <name>PEN05</name>
              <description>PPG5 Start Trigger bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN04" -->
            <field>
              <name>PEN04</name>
              <description>PPG4 Start Trigger bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN03" -->
            <field>
              <name>PEN03</name>
              <description>PPG3 Start Trigger bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN02" -->
            <field>
              <name>PEN02</name>
              <description>PPG2 Start Trigger bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN01" -->
            <field>
              <name>PEN01</name>
              <description>PPG1 Start Trigger bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PEN00" -->
            <field>
              <name>PEN00</name>
              <description>PPG0 Start Trigger bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "REVC" -->
        <register>
          <name>REVC</name>
          <description>Output Reverse Register 0</description>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV07" -->
            <field>
              <name>REV07</name>
              <description>PPG7 Output Reverse Enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV06" -->
            <field>
              <name>REV06</name>
              <description>PPG6 Output Reverse Enable bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV05" -->
            <field>
              <name>REV05</name>
              <description>PPG5 Output Reverse Enable bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV04" -->
            <field>
              <name>REV04</name>
              <description>PPG4 Output Reverse Enable bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV03" -->
            <field>
              <name>REV03</name>
              <description>PPG3 Output Reverse Enable bit</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV02" -->
            <field>
              <name>REV02</name>
              <description>PPG2 Output Reverse Enable bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV01" -->
            <field>
              <name>REV01</name>
              <description>PPG1 Output Reverse Enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV00" -->
            <field>
              <name>REV00</name>
              <description>PPG0 Output Reverse Enable bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description>PPG Operation Mode Control Register 0</description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>PPG Interrupt Enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>PPG Counter Underflow bit</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>Interrupt Mode Select bit </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>PPG DOWN Counter Operation Clock Select bits</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>PPG Operation Mode Set bits</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description>PPG start trigger select bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register derivedFrom="PPGC0">
          <name>PPGC1</name>
          <description>PPG Operation Mode Control Register 1</description>
          <addressOffset>0x200</addressOffset>
        </register>
